""" 
============================
  -*- coding:utf-8 -*-
  Author    :稳稳的幸福  
  E_mail    :1107924184@qq.com
  Time      :2019/12/27 20:45
  File      :03字符串格式化输出.py
============================
 
"""

# print("今天收到张三，交来学费500，开此收据为凭证")
# print("今天收到李四，交来学费500，开此收据为凭证")
# print("今天收到旺旺，交来学费500，开此收据为凭证")
# print("今天收到虾米，交来学费500，开此收据为凭证")
#

# # format:格式化输出，使用{}进行占位
# name = input("请输入姓名")
# desc_info = "今天收到{}，交来学费500，开此收据为凭证".format(name)
# print(desc_info)
#
# # 参数多填可以，少填报错
# s2 = "我的名字是：{}，年龄：{}，性别：{}".format("小米", 18, "nv", "tr")
# s3 = "我的名字是：{}，年龄：{}，性别：{}".format("小米", 18, )
# print(s2)
# print(s3)


# format的高级用法
# 通过下标来控制 传入的数据显示的位置
s2 = "vvv：{1}，bbb：{2}，rrr：{0}".format("小米", 18, "女", "tr")
print(s2)

# 通过变量名来控制显示的位置，可传同一个变量名
s2 = "vvv：{a}，bbb：{b}，rrr：{c}".format(a="小米", b=18, c="女", )
print(s2)

# 可以指定占位的位置长度:10
# 默认靠左显示
# 可以通过<>^ 来控制靠左 靠右 或者居中显示
s2 = "vvv：{:10}8888888".format('pppp')
s3 = "vvv：{:>10}8888888".format('pppp')
s4 = "vvv：{:<10}8888888".format('pppp')
s5 = "vvv：{:^10}8888888".format('pppp')
print(s2)
print(s3)
print(s4)
print(s5)

# 格式化浮点数的小数点后位数
s = "数字：{:.2f}".format(2.7485266)
s1 = "数字：{:.2f}".format(28)
print(s)
print(s1)

# 格式化 数值的百分比形式显示
s = "数字：{:.2%}".format(0.559)
print(s)

# 传统的格式化输出方式
# 使用%进行占位
# %f 只能为数值类型占位，显示的是带小数的形式
# %d 只能为数值类型占位，显示的是整数的形式（如果是浮点数显示直接取整）
# %s 万能的占位符（整数、浮点数、字符串都可以）

s = "python:%s,年龄:%d" % ("666", 29.96)
print(s)

# 扩展F表达式（最好用的一种，目前还不是特别流行，3.6以及以上版本才支持）
name = input("请输入姓名:")
age = 18
salary = 25.636
s = F"姓名{name},年龄：{age * 2}，性别{'男'}，{salary:.2f}"
print(s)
