""" 
============================
  -*- coding:utf-8 -*-
  Author    :稳稳的幸福  
  E_mail    :1107924184@qq.com
  Time      :2019/12/30 21:32
  File      :05字典的增删查改.py
============================
 
"""

"""
1.添加元素

2、修改元素


3、删除元素


4、查找元素


5、其他的几个方法：
python中的关键字：del
可以用来删除任何数据（可以是变量、可以是某个数据）



"""

dic = {"a": 11, "b": 22, "c": 33}

# # ----------------添加元素---------------
# # 直接通过键去赋值（如果没有这个键那就是新增键值对；如果有这个键那就是修改这个键所对应的的值）
#
# dic = {"a": 11, "b": 22, "c": 33}
# dic["aa"] = 99
# print(dic)
#
# # update:一次性往字典中添加多个键值对（将一个字典更新到原来的字典中）
# dic.update({"aa": 111, "bb": 222, "cc": 333})
# print(dic)

# # ----------------修改元素-------------
# # 直接通过键去赋值（如果有这个键那就是修改这个键所对应的的值）
#
#
# # ----------------删除元素--------------
#
# dic = {"a": 11, "b": 22, "c": 33}
# # pop：通过键去删除对应的键值对,返回对应的value
# v = dic.pop('a')
# print(dic)
# print(v)
#
# # popitem:默认删除最后一个键值对,返回键值对
# v = dic.popitem()
# print(dic)
# print(v)
# #
# # # ----------------查找元素----------------
#
# dic = {'a': 11, 'b': 22, 'c': 33, 'aa': 111, 'bb': 222, 'cc': 333}
#
# # 通过键找对应的值,如果键不存在，报错KeyError
# res = dic['aa']
# print(res)
#
# # get方法，如果键不存在，不报错,返回None
# res1 = dic['aa']
# print(res1)
#
# # 其他几种方法
# # keys：获取字典中所有键，可以通过list转换一个列表
# res2 = dic.keys()
# print(res2)
#
# # values：获取字典中所有值，可以通过list转换一个列表
# res3 = dic.values()
# print(res3, type(res3))
#
# # items：获取字典中所有键值对
# res4 = dic.items()
# print(res4, type(res4))
#
# # --------------------------------关键字del------------------------
a = 100

# 删除变量
del a
# 报错：NameError: name 'a' is not defined
print(a)

li = [1, 2, 3]
# 删除列表中的元素
del li[0]
print(li)

dic2 = {"aa": 11, "bb": 22}
# 删除字典中的某个键值对
del dic2["aa"]
print(dic2)
